sterentev/atdf-device-asm-include/inc/AT90PWM3B.inc
; ----------	Register EUCSRB bits		------------------------
.equ	EUSART		= 4		; 0x10 - EUSART Enable Bit
.equ	EUSBS		= 3		; 0x08 - EUSBS Enable Bit
.equ	EMCH		= 1		; 0x02 - Manchester Mode Bit
.equ	BODR		= 0		; 0x01 - Order Bit

; ----------	Register EUCSRC bits		------------------------
.equ	FEM		= 3		; 0x08 - Frame Error Manchester Bit
.equ	F1617		= 2		; 0x04 - F1617 Bit
.equ	STP_MASK	= 0x03		;      - Stop Bits (2 bits)
.equ	STP0		= 0		;          STP BIT0 position

; ----------	Register MUBRR bits		------------------------
.equ	MUBRR_MASK	= 0xFFFF	;      - Manchester Receiver Baud Rate Register Bits (16 bits)
.equ	MUBRR0		= 0		;          MUBRR BIT0 position



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register AC0CON bits		------------------------
.equ	AC0EN		= 7		; 0x80 - Analog Comparator 0 Enable Bit
.equ	AC0IE		= 6		; 0x40 - Analog Comparator 0 Interrupt Enable Bit
.equ	AC0IS_MASK	= 0x30		;      - Analog Comparator 0  Interrupt Select Bit (2 bits)
.equ	AC0IS0		= 4		;          AC0IS BIT0 position
.equ	AC0M_MASK	= 0x07		;      - Analog Comparator 0 Multiplexer Register (3 bits)
.equ	AC0M0		= 0		;          AC0M BIT0 position

; ----------	Register AC1CON bits		------------------------
.equ	AC1EN		= 7		; 0x80 - Analog Comparator 1 Enable Bit
.equ	AC1IE		= 6		; 0x40 - Analog Comparator 1 Interrupt Enable Bit
.equ	AC1IS_MASK	= 0x30		;      - Analog Comparator 1  Interrupt Select Bit (2 bits)
.equ	AC1IS0		= 4		;          AC1IS BIT0 position
.equ	AC1ICE		= 3		; 0x08 - Analog Comparator 1 Interrupt Capture Enable Bit
.equ	AC1M_MASK	= 0x07		;      - Analog Comparator 1 Multiplexer Register (3 bits)
.equ	AC1M0		= 0		;          AC1M BIT0 position
; ::::  AC1IS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x10		; Reserved
;			0x20		; Interrupt on Falling Edge
;			0x30		; Interrupt on Rising Edge

; ----------	Register AC2CON bits		------------------------
.equ	AC2EN		= 7		; 0x80 - Analog Comparator 2 Enable Bit
.equ	AC2IE		= 6		; 0x40 - Analog Comparator 2 Interrupt Enable Bit
.equ	AC2IS_MASK	= 0x30		;      - Analog Comparator 2  Interrupt Select Bit (2 bits)
.equ	AC2IS0		= 4		;          AC2IS BIT0 position
.equ	AC2M_MASK	= 0x07		;      - Analog Comparator 2 Multiplexer Register (3 bits)
.equ	AC2M0		= 0		;          AC2M BIT0 position
; ::::  AC2IS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x10		; Reserved
;			0x20		; Interrupt on Falling Edge
;			0x30		; Interrupt on Rising Edge

; ----------	Register ACSR bits		------------------------
.equ	ACCKDIV		= 7		; 0x80 - Analog Comparator Clock Divider
.equ	AC2IF		= 6		; 0x40 - Analog Comparator 2 Interrupt Flag Bit
.equ	AC1IF		= 5		; 0x20 - Analog Comparator 1  Interrupt Flag Bit
.equ	AC0IF		= 4		; 0x10 - Analog Comparator 0 Interrupt Flag Bit
.equ	AC2O		= 2		; 0x04 - Analog Comparator 2 Output Bit
.equ	AC1O		= 1		; 0x02 - Analog Comparator 1 Output Bit
.equ	AC0O		= 0		; 0x01 - Analog Comparator 0 Output Bit



; ====	DAC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register DAC bits		------------------------
.equ	DAC_MASK	= 0xFFFF	;      - DAC Data Register Bits (16 bits)
.equ	DAC0		= 0		;          DAC BIT0 position

; ----------	Register DACON bits		------------------------
.equ	DAATE		= 7		; 0x80 - DAC Auto Trigger Enable Bit
.equ	DATS_MASK	= 0x70		;      - DAC Trigger Selection Bits (3 bits)
.equ	DATS0		= 4		;          DATS BIT0 position
.equ	DALA		= 2		; 0x04 - DAC Left Adjust
.equ	DAOE		= 1		; 0x02 - DAC Output Enable
.equ	DAEN		= 0		; 0x01 - DAC Enable Bit
; ::::  DATS	:::: bitfield values
;			0x00		; Analog Comparator 0
;			0x10		; Analog Comparator 1
;			0x20		; External Interrupt Request 0
;			0x30		; Timer/Counter0 Compare Match A
;			0x40		; Timer/Counter0 Overflow
;			0x50		; Timer/Counter1 Compare Match B
;			0x60		; Timer/Counter1 Overflow
;			0x70		; Timer/Counter1 Capture Event



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	SPIPS		= 7		; 0x80 - SPI Pin Select
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - 
.equ	CLKPS_MASK	= 0x0F		;      -  (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Reserved
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Reserved

; ----------	Register GPIOR3 bits		------------------------
.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 3 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR2 bits		------------------------
;.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 2 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR1 bits		------------------------
;.equ	GPIOR_MASK	= 0xFF		;      - General Purpose IO Register 1 bis (8 bits)
;.equ	GPIOR0		= 0		;          GPIOR BIT0 position

; ----------	Register GPIOR0 bits		------------------------
.equ	GPIOR07		= 7		; 0x80 - General Purpose IO Register 0 bit 7
.equ	GPIOR06		= 6		; 0x40 - General Purpose IO Register 0 bit 6
.equ	GPIOR05		= 5		; 0x20 - General Purpose IO Register 0 bit 5
.equ	GPIOR04		= 4		; 0x10 - General Purpose IO Register 0 bit 4
.equ	GPIOR03		= 3		; 0x08 - General Purpose IO Register 0 bit 3
.equ	GPIOR02		= 2		; 0x04 - General Purpose IO Register 0 bit 2
.equ	GPIOR01		= 1		; 0x02 - General Purpose IO Register 0 bit 1
.equ	GPIOR00		= 0		; 0x01 - General Purpose IO Register 0 bit 0

; ----------	Register PLLCSR bits		------------------------
.equ	PLLF		= 2		; 0x04 - PLL Factor
.equ	PLLE		= 1		; 0x02 - PLL Enable
.equ	PLOCK		= 0		; 0x01 - PLL Lock Detector

; ----------	Register PRR bits		------------------------
.equ	PRPSC2		= 7		; 0x80 - Power Reduction PSC2
.equ	PRPSC1		= 6		; 0x40 - Power Reduction PSC1
.equ	PRPSC0		= 5		; 0x20 - Power Reduction PSC0
.equ	PRTIM1		= 4		; 0x10 - Power Reduction Timer/Counter1
.equ	PRTIM0		= 3		; 0x08 - Power Reduction Timer/Counter0
.equ	PRSPI		= 2		; 0x04 - Power Reduction Serial Peripheral Interface
.equ	PRUSART0	= 1		; 0x02 - Power Reduction USART
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC



; ====	TC8 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TIMSK0 bits		------------------------
.equ	OCIE0B		= 2		; 0x04 - Timer/Counter0 Output Compare Match B Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Timer/Counter0 Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	OCF0B		= 2		; 0x04 - Timer/Counter0 Output Compare Flag 0B
.equ	OCF0A		= 1		; 0x02 - Timer/Counter0 Output Compare Flag 0A
.equ	TOV0		= 0		; 0x01 - Timer/Counter0 Overflow Flag

; ----------	Register TCCR0A bits		------------------------
.equ	COM0A_MASK	= 0xC0		;      - Compare Output Mode, Phase Correct PWM Mode (2 bits)
.equ	COM0A0		= 6		;          COM0A BIT0 position
.equ	COM0B_MASK	= 0x30		;      - Compare Output Mode, Fast PWm (2 bits)
.equ	COM0B0		= 4		;          COM0B BIT0 position
.equ	WGM0_MASK	= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	WGM00		= 0		;          WGM0 BIT0 position

; ----------	Register TCCR0B bits		------------------------
.equ	FOC0A		= 7		; 0x80 - Force Output Compare A
.equ	FOC0B		= 6		; 0x40 - Force Output Compare B
.equ	WGM02		= 3		; 0x08 - 
.equ	CS0_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS00		= 0		;          CS0 BIT0 position
; ::::  CS0	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCNT0 bits		------------------------
.equ	TCNT0_MASK	= 0xFF		;      - Timer Counter 0 value (8 bits)
.equ	TCNT00		= 0		;          TCNT0 BIT0 position

; ----------	Register OCR0A bits		------------------------
.equ	OCR0A_MASK	= 0xFF		;      - Timer/Counter0 Output Compare A (8 bits)
.equ	OCR0A0		= 0		;          OCR0A BIT0 position

; ----------	Register OCR0B bits		------------------------
.equ	OCR0B_MASK	= 0xFF		;      - Timer/Counter0 Output Compare B (8 bits)
.equ	OCR0B0		= 0		;          OCR0B BIT0 position

