sterentev/atdf-device-asm-include/inc/AT90PWM3B.inc
; ----------	Register UCSRB bits		------------------------
.equ	RXCIE		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE		= 5		; 0x20 - USART Data Register Empty Interrupt Enable
.equ	RXEN		= 4		; 0x10 - Receiver Enable
.equ	TXEN		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ2		= 2		; 0x04 - Character Size
.equ	RXB8		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB8		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSRC bits		------------------------
.equ	UMSEL0		= 6		; 0x40 - USART Mode Select
.equ	UPM_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM0		= 4		;          UPM BIT0 position
.equ	USBS		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ_MASK	= 0x06		;      - Character Size Bits (2 bits)
.equ	UCSZ0		= 1		;          UCSZ BIT0 position
.equ	UCPOL		= 0		; 0x01 - Clock Polarity
; ::::  UPM	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UBRR bits		------------------------
.equ	UBRR_MASK	= 0x0FFF	;      - USART Baud Rate Register Bits (12 bits)
.equ	UBRR0		= 0		;          UBRR BIT0 position



; ====	SPI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SPCR bits		------------------------
.equ	SPIE		= 7		; 0x80 - SPI Interrupt Enable
.equ	SPE		= 6		; 0x40 - SPI Enable
.equ	DORD		= 5		; 0x20 - Data Order
.equ	MSTR		= 4		; 0x10 - Master/Slave Select
.equ	CPOL		= 3		; 0x08 - Clock polarity
.equ	CPHA		= 2		; 0x04 - Clock Phase
.equ	SPR_MASK	= 0x03		;      - SPI Clock Rate Selects (2 bits)
.equ	SPR0		= 0		;          SPR BIT0 position
; ::::  SPR	>>>> This is a part of COMM_SCK_RATE_3BIT enum (see complete values list below)

; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register SPDR bits		------------------------
.equ	SPD_MASK	= 0xFF		;      - SPI Data bits (8 bits)
.equ	SPD0		= 0		;          SPD BIT0 position



; ====	WDT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register WDTCSR bits		------------------------
.equ	WDIF		= 7		; 0x80 - Watchdog Timeout Interrupt Flag
.equ	WDIE		= 6		; 0x40 - Watchdog Timeout Interrupt Enable
.equ	WDP_MASK	= 0x27		;      - Watchdog Timer Prescaler Bits (4 bits)
.equ	WDCE		= 4		; 0x10 - Watchdog Change Enable
.equ	WDE		= 3		; 0x08 - Watch Dog Enable
; ::::  WDP	:::: bitfield values
;			0x00		; Oscillator Cycles 2K
;			0x01		; Oscillator Cycles 4K
;			0x02		; Oscillator Cycles 8K
;			0x03		; Oscillator Cycles 16K
;			0x04		; Oscillator Cycles 32K
;			0x05		; Oscillator Cycles 64K
;			0x06		; Oscillator Cycles 128K
;			0x07		; Oscillator Cycles 256K
;			0x20		; Oscillator Cycles 512K
;			0x21		; Oscillator Cycles 1024K



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC3_MASK	= 0xC0		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC30		= 6		;          ISC3 BIT0 position
.equ	ISC2_MASK	= 0x30		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC20		= 4		;          ISC2 BIT0 position
.equ	ISC1_MASK	= 0x0C		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC10		= 2		;          ISC1 BIT0 position
.equ	ISC0_MASK	= 0x03		;      - External Interrupt Sense Control Bit (2 bits)
.equ	ISC00		= 0		;          ISC0 BIT0 position
; ::::  ISC3	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x40		; Any Logical Change of INTX
;			0x80		; Falling Edge of INTX
;			0xC0		; Rising Edge of INTX
; ::::  ISC2	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x10		; Any Logical Change of INTX
;			0x20		; Falling Edge of INTX
;			0x30		; Rising Edge of INTX
; ::::  ISC1	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x04		; Any Logical Change of INTX
;			0x08		; Falling Edge of INTX
;			0x0C		; Rising Edge of INTX
; ::::  ISC0	:::: bitfield values
;			0x00		; Low Level of INTX
;			0x01		; Any Logical Change of INTX
;			0x02		; Falling Edge of INTX
;			0x03		; Rising Edge of INTX

; ----------	Register EIMSK bits		------------------------
.equ	INT_MASK	= 0x0F		;      - External Interrupt Request Enable (4 bits)
.equ	INT0		= 0		;          INT BIT0 position

; ----------	Register EIFR bits		------------------------
.equ	INTF_MASK	= 0x0F		;      - External Interrupt Flags (4 bits)
.equ	INTF0		= 0		;          INTF BIT0 position



; ====	EEPROM MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EEAR bits		------------------------
.equ	EEAR_MASK	= 0x0FFF	;      - EEPROM Address bytes (12 bits)
.equ	EEAR0		= 0		;          EEAR BIT0 position

; ----------	Register EEDR bits		------------------------
.equ	EEDR_MASK	= 0xFF		;      - EEPROM Data Bits (8 bits)
.equ	EEDR0		= 0		;          EEDR BIT0 position

; ----------	Register EECR bits		------------------------
.equ	EEPM_MASK	= 0x30		;      - EEPROM Programming Mode (2 bits)
.equ	EEPM0		= 4		;          EEPM BIT0 position
.equ	EERIE		= 3		; 0x08 - EEPROM Ready Interrupt Enable
.equ	EEMWE		= 2		; 0x04 - EEPROM Master Write Enable
.equ	EEWE		= 1		; 0x02 - EEPROM Write Enable
.equ	EERE		= 0		; 0x01 - EEPROM Read Enable



; ====	PSC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register PICR0 bits		------------------------
.equ	PCST0		= 15		; 0x8000 - PSC 0 Input Capture Software Trig
.equ	PICR0_MASK	= 0x0FFF	;      - PSC 0 Input Capture Bytes (12 bits)
.equ	PICR00		= 0		;          PICR0 BIT0 position

; ----------	Register PFRC0B bits		------------------------
.equ	PCAE0B		= 7		; 0x80 - PSC 0 Capture Enable Input Part B
.equ	PISEL0B		= 6		; 0x40 - PSC 0 Input Select for Part B
.equ	PELEV0B		= 5		; 0x20 - PSC 0 Edge Level Selector on Input Part B
.equ	PFLTE0B		= 4		; 0x10 - PSC 0 Filter Enable on Input Part B
.equ	PRFM0B_MASK	= 0x0F		;      - PSC 0 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM0B0		= 0		;          PRFM0B BIT0 position

; ----------	Register PFRC0A bits		------------------------
.equ	PCAE0A		= 7		; 0x80 - PSC 0 Capture Enable Input Part A
.equ	PISEL0A		= 6		; 0x40 - PSC 0 Input Select for Part A
.equ	PELEV0A		= 5		; 0x20 - PSC 0 Edge Level Selector on Input Part A
.equ	PFLTE0A		= 4		; 0x10 - PSC 0 Filter Enable on Input Part A
.equ	PRFM0A_MASK	= 0x0F		;      - PSC 0 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM0A0		= 0		;          PRFM0A BIT0 position

; ----------	Register PCTL0 bits		------------------------
.equ	PPRE0_MASK	= 0xC0		;      - PSC 0 Prescaler Selects (2 bits)
.equ	PPRE00		= 6		;          PPRE0 BIT0 position
.equ	PBFM0		= 5		; 0x20 - PSC 0 Balance Flank Width Modulation
.equ	PAOC0B		= 4		; 0x10 - PSC 0 Asynchronous Output Control B
.equ	PAOC0A		= 3		; 0x08 - PSC 0 Asynchronous Output Control A
.equ	PARUN0		= 2		; 0x04 - PSC0 Auto Run
.equ	PCCYC0		= 1		; 0x02 - PSC0 Complete Cycle
.equ	PRUN0		= 0		; 0x01 - PSC 0 Run

; ----------	Register PCNF0 bits		------------------------
.equ	PFIFTY0		= 7		; 0x80 - PSC 0 Fifty
.equ	PALOCK0		= 6		; 0x40 - PSC 0 Autolock
.equ	PLOCK0		= 5		; 0x20 - PSC 0 Lock
.equ	PMODE0_MASK	= 0x18		;      - PSC 0 Mode (2 bits)
.equ	PMODE00		= 3		;          PMODE0 BIT0 position
.equ	POP0		= 2		; 0x04 - PSC 0 Output Polarity
.equ	PCLKSEL0	= 1		; 0x02 - PSC 0 Input Clock Select

; ----------	Register OCR0RB bits		------------------------
.equ	OCR0RB_MASK	= 0xFFFF	;      - Output Compare RB (16 bits)
.equ	OCR0RB0		= 0		;          OCR0RB BIT0 position

; ----------	Register OCR0SB bits		------------------------
.equ	OCR0SB_MASK	= 0x0FFF	;      - Output Compare SB (12 bits)
.equ	OCR0SB0		= 0		;          OCR0SB BIT0 position

; ----------	Register OCR0RA bits		------------------------
.equ	OCR0RA_MASK	= 0x0FFF	;      - Output Compare RA (12 bits)
.equ	OCR0RA0		= 0		;          OCR0RA BIT0 position

; ----------	Register OCR0SA bits		------------------------
.equ	OCR0SA_MASK	= 0x0FFF	;      - Output Compare SA (12 bits)
.equ	OCR0SA0		= 0		;          OCR0SA BIT0 position

