sterentev/atdf-device-asm-include/inc/AT90PWM3B.inc
; ----------	Register PSOC0 bits		------------------------
.equ	PSYNC0_MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC00		= 4		;          PSYNC0 BIT0 position
.equ	POEN0B		= 2		; 0x04 - PSCOUT01 Output Enable
.equ	POEN0A		= 0		; 0x01 - PSCOUT00 Output Enable

; ----------	Register PIM0 bits		------------------------
.equ	PSEIE0		= 5		; 0x20 - PSC 0 Synchro Error Interrupt Enable
.equ	PEVE0B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE0A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE0		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR0 bits		------------------------
.equ	POAC0B		= 7		; 0x80 - PSC 0 Output A Activity
.equ	POAC0A		= 6		; 0x40 - PSC 0 Output A Activity
.equ	PSEI0		= 5		; 0x20 - PSC 0 Synchro Error Interrupt
.equ	PEV0B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV0A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN0_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN00		= 1		;          PRN0 BIT0 position
.equ	PEOP0		= 0		; 0x01 - End of PSC0 Interrupt

; ----------	Register PICR1 bits		------------------------
.equ	PCST1		= 15		; 0x8000 - PSC 1 Input Capture Software Trig
.equ	PICR1_MASK	= 0x0FFF	;      - PSC 1 Input Capture Bytes (12 bits)
.equ	PICR10		= 0		;          PICR1 BIT0 position

; ----------	Register PFRC1B bits		------------------------
.equ	PCAE1B		= 7		; 0x80 - PSC 1 Capture Enable Input Part B
.equ	PISEL1B		= 6		; 0x40 - PSC 1 Input Select for Part B
.equ	PELEV1B		= 5		; 0x20 - PSC 1 Edge Level Selector on Input Part B
.equ	PFLTE1B		= 4		; 0x10 - PSC 1 Filter Enable on Input Part B
.equ	PRFM1B_MASK	= 0x0F		;      - PSC 1 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM1B0		= 0		;          PRFM1B BIT0 position

; ----------	Register PFRC1A bits		------------------------
.equ	PCAE1A		= 7		; 0x80 - PSC 1 Capture Enable Input Part A
.equ	PISEL1A		= 6		; 0x40 - PSC 1 Input Select for Part A
.equ	PELEV1A		= 5		; 0x20 - PSC 1 Edge Level Selector on Input Part A
.equ	PFLTE1A		= 4		; 0x10 - PSC 1 Filter Enable on Input Part A
.equ	PRFM1A_MASK	= 0x0F		;      - PSC 1 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM1A0		= 0		;          PRFM1A BIT0 position

; ----------	Register PCTL1 bits		------------------------
.equ	PPRE1_MASK	= 0xC0		;      - PSC 1 Prescaler Selects (2 bits)
.equ	PPRE10		= 6		;          PPRE1 BIT0 position
.equ	PBFM1		= 5		; 0x20 - Balance Flank Width Modulation
.equ	PAOC1B		= 4		; 0x10 - PSC 1 Asynchronous Output Control B
.equ	PAOC1A		= 3		; 0x08 - PSC 1 Asynchronous Output Control A
.equ	PARUN1		= 2		; 0x04 - PSC1 Auto Run
.equ	PCCYC1		= 1		; 0x02 - PSC1 Complete Cycle
.equ	PRUN1		= 0		; 0x01 - PSC 1 Run

; ----------	Register PCNF1 bits		------------------------
.equ	PFIFTY1		= 7		; 0x80 - PSC 1 Fifty
.equ	PALOCK1		= 6		; 0x40 - PSC 1 Autolock
.equ	PLOCK1		= 5		; 0x20 - PSC 1 Lock
.equ	PMODE1_MASK	= 0x18		;      - PSC 1 Mode (2 bits)
.equ	PMODE10		= 3		;          PMODE1 BIT0 position
.equ	POP1		= 2		; 0x04 - PSC 1 Output Polarity
.equ	PCLKSEL1	= 1		; 0x02 - PSC 1 Input Clock Select

; ----------	Register OCR1RB bits		------------------------
.equ	OCR1RB_MASK	= 0xFFFF	;      - Output Compare 1 RB (16 bits)
.equ	OCR1RB0		= 0		;          OCR1RB BIT0 position

; ----------	Register OCR1SB bits		------------------------
.equ	OCR1SB_MASK	= 0x0FFF	;      - Output Compare 1 SB (12 bits)
.equ	OCR1SB0		= 0		;          OCR1SB BIT0 position

; ----------	Register OCR1RA bits		------------------------
.equ	OCR1RA_MASK	= 0x0FFF	;      - Output Compare 1 RA (12 bits)
.equ	OCR1RA0		= 0		;          OCR1RA BIT0 position

; ----------	Register OCR1SA bits		------------------------
.equ	OCR1SA_MASK	= 0x0FFF	;      - Output Compare 1 SA (12 bits)
.equ	OCR1SA0		= 0		;          OCR1SA BIT0 position

; ----------	Register PSOC1 bits		------------------------
.equ	PSYNC1__MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC1_0	= 4		;          PSYNC1_ BIT0 position
.equ	POEN1B		= 2		; 0x04 - PSCOUT11 Output Enable
.equ	POEN1A		= 0		; 0x01 - PSCOUT10 Output Enable

; ----------	Register PIM1 bits		------------------------
.equ	PSEIE1		= 5		; 0x20 - PSC 1 Synchro Error Interrupt Enable
.equ	PEVE1B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE1A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE1		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR1 bits		------------------------
.equ	POAC1B		= 7		; 0x80 - PSC 1 Output B Activity
.equ	POAC1A		= 6		; 0x40 - PSC 1 Output A Activity
.equ	PSEI1		= 5		; 0x20 - PSC 1 Synchro Error Interrupt
.equ	PEV1B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV1A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN1_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN10		= 1		;          PRN1 BIT0 position
.equ	PEOP1		= 0		; 0x01 - End of PSC1 Interrupt

; ----------	Register PICR2 bits		------------------------
.equ	PCST2		= 15		; 0x8000 - PSC 2 Input Capture Software Trig
.equ	PICR2_MASK	= 0x0FFF	;      - PSC 2 Input Capture Bytes (12 bits)
.equ	PICR20		= 0		;          PICR2 BIT0 position

; ----------	Register PFRC2B bits		------------------------
.equ	PCAE2B		= 7		; 0x80 - PSC 2 Capture Enable Input Part B
.equ	PISEL2B		= 6		; 0x40 - PSC 2 Input Select for Part B
.equ	PELEV2B		= 5		; 0x20 - PSC 2 Edge Level Selector on Input Part B
.equ	PFLTE2B		= 4		; 0x10 - PSC 2 Filter Enable on Input Part B
.equ	PRFM2B_MASK	= 0x0F		;      - PSC 2 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM2B0		= 0		;          PRFM2B BIT0 position

; ----------	Register PFRC2A bits		------------------------
.equ	PCAE2A		= 7		; 0x80 - PSC 2 Capture Enable Input Part A
.equ	PISEL2A		= 6		; 0x40 - PSC 2 Input Select for Part A
.equ	PELEV2A		= 5		; 0x20 - PSC 2 Edge Level Selector on Input Part A
.equ	PFLTE2A		= 4		; 0x10 - PSC 2 Filter Enable on Input Part A
.equ	PRFM2A_MASK	= 0x0F		;      - PSC 2 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM2A0		= 0		;          PRFM2A BIT0 position

; ----------	Register PCTL2 bits		------------------------
.equ	PPRE2_MASK	= 0xC0		;      - PSC 2 Prescaler Selects (2 bits)
.equ	PPRE20		= 6		;          PPRE2 BIT0 position
.equ	PBFM2		= 5		; 0x20 - Balance Flank Width Modulation
.equ	PAOC2B		= 4		; 0x10 - PSC 2 Asynchronous Output Control B
.equ	PAOC2A		= 3		; 0x08 - PSC 2 Asynchronous Output Control A
.equ	PARUN2		= 2		; 0x04 - PSC2 Auto Run
.equ	PCCYC2		= 1		; 0x02 - PSC2 Complete Cycle
.equ	PRUN2		= 0		; 0x01 - PSC 2 Run

; ----------	Register PCNF2 bits		------------------------
.equ	PFIFTY2		= 7		; 0x80 - PSC 2 Fifty
.equ	PALOCK2		= 6		; 0x40 - PSC 2 Autolock
.equ	PLOCK2		= 5		; 0x20 - PSC 2 Lock
.equ	PMODE2_MASK	= 0x18		;      - PSC 2 Mode (2 bits)
.equ	PMODE20		= 3		;          PMODE2 BIT0 position
.equ	POP2		= 2		; 0x04 - PSC 2 Output Polarity
.equ	PCLKSEL2	= 1		; 0x02 - PSC 2 Input Clock Select
.equ	POME2		= 0		; 0x01 - PSC 2 Output Matrix Enable

; ----------	Register OCR2RB bits		------------------------
.equ	OCR2RB_MASK	= 0xFFFF	;      - Output Compare RB (16 bits)
.equ	OCR2RB0		= 0		;          OCR2RB BIT0 position

; ----------	Register OCR2SB bits		------------------------
.equ	OCR2SB_MASK	= 0x0FFF	;      - Output Compare SB (12 bits)
.equ	OCR2SB0		= 0		;          OCR2SB BIT0 position

; ----------	Register OCR2RA bits		------------------------
.equ	OCR2RA_MASK	= 0x0FFF	;      - Output Compare RA (12 bits)
.equ	OCR2RA0		= 0		;          OCR2RA BIT0 position

; ----------	Register OCR2SA bits		------------------------
.equ	OCR2SA_MASK	= 0x0FFF	;      - Output Compare SA (12 bits)
.equ	OCR2SA0		= 0		;          OCR2SA BIT0 position

; ----------	Register POM2 bits		------------------------
.equ	POMV2B_MASK	= 0xF0		;      - Output Matrix Output B Ramps (4 bits)
.equ	POMV2B0		= 4		;          POMV2B BIT0 position
.equ	POMV2A_MASK	= 0x0F		;      - Output Matrix Output A Ramps (4 bits)
.equ	POMV2A0		= 0		;          POMV2A BIT0 position

; ----------	Register PSOC2 bits		------------------------
.equ	POS2_MASK	= 0xC0		;      - PSC 2 Output 23 Select (2 bits)
.equ	POS20		= 6		;          POS2 BIT0 position
.equ	PSYNC2__MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC2_0	= 4		;          PSYNC2_ BIT0 position
.equ	POEN2D		= 3		; 0x08 - PSCOUT23 Output Enable
.equ	POEN2B		= 2		; 0x04 - PSCOUT21 Output Enable
.equ	POEN2C		= 1		; 0x02 - PSCOUT22 Output Enable
.equ	POEN2A		= 0		; 0x01 - PSCOUT20 Output Enable

; ----------	Register PIM2 bits		------------------------
.equ	PSEIE2		= 5		; 0x20 - PSC 2 Synchro Error Interrupt Enable
.equ	PEVE2B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE2A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE2		= 0		; 0x01 - End of Cycle Interrupt Enable

